app/controllers/students_controller.rb

    def create
        student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Paul"], ["last_name", "Nicholsen"], ["created_at", "2020-05-18 16:42:19.495444"], ["updated_at", "2020-05-18 16:42:19.495444"]]

    def update
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Naborssss"], ["updated_at", "2020-05-18 16:59:12.591114"], ["id", 6]]

    def find_student
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]